@beevital is there a list of the supported services? The [provider docs](https://registry.terraform.io/providers/fivetran/fivetran/latest/docs/resources/connector) link to the [Fivetran API docs](https://fivetran.com/docs/rest-api/connectors/config) which list all the connectors including the dbt_cloud connector.

And could this enforcement be more aggressive, as stated before the initial `terraform apply` the lock file didn't have a dbt_cloud service and terraform actually created the connector. As an example here's what the plan looks like with a clean tfstate.

```hcl
~/code/nyt/fivetran-poc (main*) » terraform plan                                                                                    andrey@A13255
fivetran_group.nyt_extstreams_dev: Refreshing state... [id=****]
fivetran_destination.nyt_extstreams_dev: Refreshing state... [id=****]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fivetran_connector.dbt_cloud_connector will be created
  + resource "fivetran_connector" "dbt_cloud_connector" {
      + connected_by    = (known after apply)
      + created_at      = (known after apply)
      + group_id        = "****"
      + id              = (known after apply)
      + last_updated    = (known after apply)
      + name            = (known after apply)
      + run_setup_tests = "true"
      + service         = "dbt_cloud"

      + config {
          ....
          + api_key                              = (sensitive value)
          + sub_domain                           = "US region"
          ....
        }

      + destination_schema {
          + name = "fivetran_dbt_cloud_test"
        }
    }

  # fivetran_connector_schedule.connector_schedule will be created
  + resource "fivetran_connector_schedule" "connector_schedule" {
      + connector_id      = (known after apply)
      + id                = (known after apply)
      + pause_after_trial = "true"
      + paused            = "false"
      + schedule_type     = (known after apply)
      + sync_frequency    = "120"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```